---
kind: enumMember
id: F:Autodesk.Revit.DB.WidthMeasuredAt.Base
enum: Autodesk.Revit.DB.WidthMeasuredAt
source: html/71ec86d8-1032-1d91-0114-bc29d8e5d48b.htm
---
# Autodesk.Revit.DB.WidthMeasuredAt.Base

The base constraint of the wall.